devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
                                hdl->eth.Instance = ETH;
                                hdl->eth.Init.MACAddr = hdl->MAC_addr;
                                hdl->eth.Init.AutoNegotiation = __ETH_PHY_AUTONEGOTIATION__;
                                hdl->eth.Init.Speed = __ETH_SPEED__;
                                hdl->eth.Init.DuplexMode = ETH_MODE_FULLDUPLEX;
                                hdl->eth.Init.RxMode = ETH_RXINTERRUPT_MODE;
                                hdl->eth.Init.ChecksumMode = __ETH_CHECKSUM_BY_HARDWARE__;
                                hdl->eth.Init.PhyAddress = __ETH_PHY_ADDRESS__;

                                err = HAL_ETH_Init(&hdl->eth);
                                if (!err) {
                                        /* Initialize Tx Descriptors list: Chain Mode */
                                        HAL_ETH_DMATxDescListInit(&hdl->eth, hdl->DMATxDscrTab,
                                                                  &hdl->Tx_Buff[0][0], __ETH_TXBUFNB__);

                                        /* Initialize Rx Descriptors list: Chain Mode  */
                                        HAL_ETH_DMARxDescListInit(&hdl->eth, hdl->DMARxDscrTab,
                                                                  &hdl->Rx_Buff[0][0], __ETH_RXBUFNB__);
                                        eth->configured = true;
                                }
                        } else {
                                err = EBUSY;
                        }
                }
                break;

        case IOCTL_ETH__SEND_PACKET:
                if (arg) {
                        err = packet_send(hdl, arg);
                }
                break;

        case IOCTL_ETH__SET_RX_TIMEOUT:
                if (arg) {
                        hdl->rx_timeout_ms = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_ETH__SET_TX_TIMEOUT:
                if (arg) {
                        hdl->tx_timeout_ms = *cast(u32_t*, arg);
                }
                break;

        case IOCTL_ETH__RECEIVE_PACKET:
                if (arg) {
                        err = packet_receive(hdl, arg);
                }
                break;

        case IOCTL_ETH__START:
                if (not hdl->run and hdl->configured) {
                        err = HAL_ETH_Start(&hdl->eth);
                        if (!err) {
                                hdl->run = true;
                        }
                } else {
                        err = EPERM;
                }
                break;

        case IOCTL_ETH__STOP:
                if (hdl->run) {
                        err = HAL_ETH_Stop(&hdl->eth);
                        if (!err) {
                                hdl->run = false;
                        }
                } else {
                        err = EPERM;
                }
                break;

        case IOCTL_ETH__GET_STATUS:
                if (arg) {
                        ETH_status_t *status = cast(ETH_status_t*, arg);

                        u32_t reg;
                        if (HAL_ETH_ReadPHYRegister(&hdl->eth, PHY_BSR, &reg) == HAL_OK) {

                                if (reg & PHY_BSR_LINK_STATUS) {
                                        status->link_status = ETH_LINK_STATUS__CONNECTED;
                                } else {
                                        status->link_status = ETH_LINK_STATUS__DISCONNECTED;
                                }
                        } else {
                                status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                        }

                        if (HAL_ETH_ReadPHYRegister(&hdl->eth, __ETH_PHY_SR__, &reg) == HAL_OK) {

                                if (reg & __ETH_PHY_SPEED_STATUS_BM__) {
                                        status->speed = ETH_SPEED__10Mbps;
                                } else {
                                        status->speed = ETH_SPEED__100Mbps;
                                }

                                if (reg & __ETH_PHY_DUPLEX_STATUS_BM__) {
                                        status->speed = ETH_DUPLEX__FULL;
                                } else {
                                        status->speed = ETH_DUPLEX__HALF;
                                }
                        } else {
                                status->link_status = ETH_LINK_STATUS__PHY_ERROR;
                        }

                        memcpy(status->MAC, hdl->MAC_addr, sizeof(status->MAC));

                        status->rx_bytes   = hdl->stats.rx_bytes;
                        status->tx_bytes   = hdl->stats.tx_bytes;
                        status->rx_packets = hdl->stats.rx_packets;
                        status->tx_packets = hdl->stats.tx_packets;

                        switch (HAL_ETH_GetState(&hdl->eth)) {
                        case HAL_ETH_STATE_RESET:
                                status->state = ETH_STATE__RESET;
                                break;
                        case HAL_ETH_STATE_READY:
                        case HAL_ETH_STATE_BUSY:
                        case HAL_ETH_STATE_BUSY_TX:
                        case HAL_ETH_STATE_BUSY_RX:
                        case HAL_ETH_STATE_BUSY_TX_RX:
                        case HAL_ETH_STATE_BUSY_WR:
                        case HAL_ETH_STATE_BUSY_RD:
                                status->state = ETH_STATE__READY;
                                break;
                        case HAL_ETH_STATE_TIMEOUT:
                        case HAL_ETH_STATE_ERROR:
                                status->state = ETH_STATE__ERROR;
                                break;
                        }

                        update_dropped_rx_frames(hdl);
                        status->rx_dropped_frames = hdl->stats.rx_dropped_frames;

                        err = ESUCC;
                } else {
                        err = EINVAL;
                }
                break;

        default:
                return EBADRQC;
        }

