devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(ETH, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(ETH, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG1(device_handle);

        device_stat->st_size  = 0;
        device_stat->st_major = 0;
        device_stat->st_minor = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief
 *
 * @param  ?
 *
 * @return ?
 */
//==============================================================================
static int packet_send(struct eth *hdl, const ETH_packet_t *pkt)
{
        if (not hdl->run) {
                return EPERM;
        }

        __IO ETH_DMADescTypeDef *DmaTxDesc = hdl->eth.TxDesc;
        uint8_t *buffer = (uint8_t*) (DmaTxDesc->Buffer1Addr);

        u64_t tref = sys_get_uptime_ms();
        while ((DmaTxDesc->Status & ETH_DMATXDESC_OWN) != (uint32_t) RESET) {
                sys_sleep_ms(1);
                if (sys_get_uptime_ms() - tref >= hdl->tx_timeout_ms) {
                        return ETIME;
                }
        }

        /* Copy the remaining bytes */
        memcpy(buffer, pkt->payload, pkt->length);

        /* Prepare transmit descriptors to give to DMA */
        int err = HAL_ETH_TransmitFrame(&hdl->eth, pkt->length);

        /* When Transmit Underflow flag is set, clear it and issue a Transmit Poll Demand to resume transmission */
        if ((hdl->eth.Instance->DMASR & ETH_DMASR_TUS) != (uint32_t) RESET) {
                /* Clear TUS ETHERNET DMA flag */
                hdl->eth.Instance->DMASR = ETH_DMASR_TUS;

                /* Resume DMA transmission*/
                hdl->eth.Instance->DMATPDR = 0;
        }

        /* update statistics */
        update_dropped_rx_frames(hdl);
        hdl->stats.tx_packets++;
        hdl->stats.tx_bytes += pkt->length;

        return err;
}

//==============================================================================
/**
 * @brief
 *
 * @param  ?
 *
 * @return ?
 */
//==============================================================================
static int packet_receive(struct eth *hdl, ETH_packet_t *pkt)
{
        if (not hdl->run) {
                return EPERM;
        }

        int err = sys_semaphore_wait(hdl->semaphore, hdl->rx_timeout_ms);
        if (!err) {
                /* get received frame */
                if (HAL_ETH_GetReceivedFrame_IT(&hdl->eth) != HAL_OK) {
                        printk("ETH: frame receive error");
                        return EIO;
                }

                /* Obtain the size of the packet and put it into the "len" variable. */
                uint16_t len = hdl->eth.RxFrameInfos.length;
                uint8_t *buffer = (uint8_t*)hdl->eth.RxFrameInfos.buffer;

                if (len > 0) {
                        pkt->length = len;
                        memcpy(pkt->payload, buffer, min(pkt->length, len));
                }

                /* Release descriptors to DMA */
                __IO ETH_DMADescTypeDef *dmarxdesc = hdl->eth.RxFrameInfos.FSRxDesc;

                /* Set Own bit in Rx descriptors: gives the buffers back to DMA */
                for (u32_t i = 0; i < hdl->eth.RxFrameInfos.SegCount; i++) {
                        dmarxdesc->Status |= ETH_DMARXDESC_OWN;
                        dmarxdesc = (ETH_DMADescTypeDef*)(dmarxdesc->Buffer2NextDescAddr);
                }

                /* Clear Segment_Count */
                hdl->eth.RxFrameInfos.SegCount = 0;

                /* When Rx Buffer unavailable flag is set: clear it and resume reception */
                if ((hdl->eth.Instance->DMASR & ETH_DMASR_RBUS) != (uint32_t) RESET) {
                        /* Clear RBUS ETHERNET DMA flag */
                        hdl->eth.Instance->DMASR = ETH_DMASR_RBUS;
                        /* Resume DMA reception */
                        hdl->eth.Instance->DMARPDR = 0;
                }

                /* update statistics */
                update_dropped_rx_frames(hdl);
                hdl->stats.rx_packets++;
                hdl->stats.rx_bytes += len;
        }

        return err;
}

//==============================================================================
/**
 * @brief
 *
 * @param  ?
 *
 * @return ?
 */
//==============================================================================
void HAL_ETH_MspInit(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);

        /* Enable the Ethernet global Interrupt */
        NVIC_SetPriority(ETH_IRQn, _CPU_IRQ_SAFE_PRIORITY_);
        NVIC_EnableIRQ(ETH_IRQn);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);
        volatile u32_t tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACEN);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACTXEN);

        SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);
        tmp = READ_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN);

        UNUSED_ARG1(tmp);
}

//==============================================================================
/**
 * @brief
 *
 * @param  ?
 *
 * @return ?
 */
//==============================================================================
void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth)
{
        UNUSED_ARG1(heth);
        sys_semaphore_signal_from_ISR(eth->semaphore, &eth->irq_yield);
}

//==============================================================================
/**
 * @brief
 *
 * @param  ?
 *
 * @return ?
 */
//==============================================================================
static void update_dropped_rx_frames(struct eth *hdl)
{
        u32_t DMAMFBOCR = ETH->DMAMFBOCR;
        u32_t MFC = (DMAMFBOCR & ETH_DMAMFBOCR_MFC) >> ETH_DMAMFBOCR_MFC_Pos;
        hdl->stats.rx_dropped_frames += MFC;
}

//==============================================================================
/**
 * @brief  Ethernet interrupt
 * @param  None
 * @return None
 */
//==============================================================================
void ETH_IRQHandler(void)
{
        HAL_ETH_IRQHandler(&eth->eth);
        sys_thread_yield_from_ISR(eth->irq_yield);
}

/*==============================================================================
  End of file
==============================================================================*/
